---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ExportLinks
source: html/a7b76450-1c85-6a58-6ffd-1884e28c451f.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ExportLinks Property

True to export Revit links found in the main model, false to skip links.
 Default value is false.

## Syntax (C#)
```csharp
public bool ExportLinks { get; set; }
```